# ExportPatternKey Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternKey Class
Members See Also
---
A key used to represent an item stored in an ExportPatternTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportPatternKey : IDisposable
```

Visual Basic
---
```text
Public Class ExportPatternKey _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportPatternKey : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportPatternKey
# See Also
ExportPatternKey Members
Autodesk.Revit.DB Namespace